In [2]:
print("continue different types of creating dataframes in pandas")
import pandas as pd
weather_data=[{ 'name':'Ajay','class':'bca','age':22},    # indentation is incorrect thats why it was showing error
   { 'name':'Amit','class':'MCA','age':24} ]
   
   https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html         


df=pd.DataFrames(weather_data)   # * measn its running
# this usuallyw orks but not now


import pandas as pd
weather_data={
    'day':['1/1/2017','1/1/2017','1/1/2017']
}
df=pd.DataFrame(weather_data)
df

        day
0  1/1/2017
1  1/1/2017
2  1/1/2017

In [8]:
df=pd.read_excel(r"C:\Users\Ajay\Desktop\pandas_import.xlsx")   # without 'r' it will give error
df

   s.no    name class  remarks status
0     1    amit   bca       22   pass
1     2    ajay   mca       22   fail
2     3  anurag   mca       12   fail

In [9]:
# sometime in our excel file or csv file has extra header ,so for that
df=pd.read_excel(r"C:\Users\Ajay\Desktop\pandas_import.xlsx")   # without 'r' it will give error
df   # in have put only details keyword in excel file and unnames came along with it

  details Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4
0    s.no       name      class    remarks     status
1       1       amit        bca         22       pass
2       2       ajay        mca         22       fail
3       3     anurag        mca         12       fail

In [10]:
df=pd.read_excel(r"C:\Users\Ajay\Desktop\pandas_import.xlsx",skiprows=1)   # without 'r' it will give error
df    # now we skip row 1

   s.no    name class  remarks status
0     1    amit   bca       22   pass
1     2    ajay   mca       22   fail
2     3  anurag   mca       12   fail

In [11]:
df=pd.read_excel(r"C:\Users\Ajay\Desktop\pandas_import.xlsx",header=1)   # without 'r' it will give error
df     # same result

   s.no    name class  remarks status
0     1    amit   bca       22   pass
1     2    ajay   mca       22   fail
2     3  anurag   mca       12   fail

In [13]:
# sometime we do not have header 
df=pd.read_excel(r"C:\Users\Ajay\Desktop\pandas_import.xlsx",header=None)   # without 'r' it will give error
df    # it will automatically  put 0 1 2 3   # i think minimum   row will be 6 rows automaically  0 to 6

     0       1    2     3     4
0  1.0    amit  bca  22.0  pass
1  2.0    ajay  mca  22.0  fail
2  3.0  anurag  mca  12.0  fail
3  NaN     NaN  NaN   NaN   NaN
4  NaN     NaN  NaN   NaN   NaN
5  NaN     NaN  NaN   NaN   NaN
6  NaN     NaN  NaN   NaN

In [14]:
df=pd.read_excel(r"C:\Users\Ajay\Desktop\pandas_import.xlsx",header=None,names=['s.no','name','degree'])   # without 'r' it will give error
df     # in this cas i have used less column name so t produce incorrect data

           s.no  name degree
1.0 amit    bca  22.0   pass
2.0 ajay    mca  22.0   fail
3.0 anurag  mca  12.0   fail
NaN NaN     NaN   NaN    NaN
    NaN     NaN   NaN    NaN
    NaN     NaN   NaN    NaN
    NaN     NaN   NaN

In [15]:
df=pd.read_excel(r"C:\Users\Ajay\Desktop\pandas_import.xlsx",header=None,names=['s.no','name','degree','remarks','status'])   # without 'r' it will give error
df   # now it correct

   s.no    name degree  remarks status
0   1.0    amit    bca     22.0   pass
1   2.0    ajay    mca     22.0   fail
2   3.0  anurag    mca     12.0   fail
3   NaN     NaN    NaN      NaN    NaN
4   NaN     NaN    NaN      NaN    NaN
5   NaN     NaN    NaN      NaN    NaN
6   NaN     NaN    NaN      NaN

In [16]:
# sometime we have lot os row or data in csv or excel file so we can use nrows function to produce few row for us
df=pd.read_excel(r"C:\Users\Ajay\Desktop\pandas_import.xlsx",nrows=2)   # without 'r' it will give error
df   # 2 rows

   1    amit  bca  22  pass
0  2    ajay  mca  22  fail
1  3  anurag  mca  12  fail

In [19]:
# sometime our  sheet have few missing value ,we can put NaN in place of them
df=pd.read_excel(r"C:\Users\Ajay\Desktop\pandas_import.xlsx",na_values=['nono','not applicable','na'])   # without 'r' it will give error
df    # it replaces with NaN, which lokk decent as well

     1    amit  bca    22  pass
0  2.0    ajay  mca  22.0  fail
1  3.0  anurag  mca  12.0  fail
2  4.0     NaN  NaN   NaN  pass
3  NaN     NaN  NaN   NaN   NaN
4  NaN     NaN  NaN   NaN   NaN
5  NaN     NaN  NaN   NaN

In [24]:


df=pd.read_excel(r"C:\Users\Ajay\Desktop\pandas_import.xlsx",names=['s.no','name','degree','remarks','status','profitloss'] ) # without 'r' it will give error
df

   s.no    name          degree remarks status  profitloss
0   2.0    ajay             mca      22   fail         1.0
1   3.0  anurag             mca      12   fail        -1.0
2   4.0    nono  not applicable      na   pass        -1.0
3  -5.0   ashok             mba      44   pass        -4.0
4   NaN     NaN             NaN     NaN    NaN         NaN
5   NaN     NaN             NaN     NaN                NaN

In [33]:
# sometime our data doenot have na or not applicable data instud of incorrect dat , so we can tid of that data 
 #we can apply list in it
    df=pd.read_excel(r"C:\Users\Ajay\Desktop\pandas_import.xlsx",names=['s.no','name','degree','remarks','status','profitloss'] 
                     ,na_values={
                         's.no':[-5],
                         'name':['nono','not applicable','na'],
                         'degree':['nono','not applicable','na']
                     }) # without 'r' it will give error
df    # usually this work but not now

IndentationError: unexpected indent (<ipython-input-33-cca1ccc48593>, line 3)

In [31]:
na_values={'s.no':[-5],'name':['nono','not applicable','na'],'degree':['nono','not applicable','na']}
na_values

{'s.no': [-5],
 'name': ['nono', 'not applicable', 'na'],
 'degree': ['nono', 'not applicable', 'na']}

In [37]:
#writing to your new excel file
df=pd.read_excel(r"C:\Users\Ajay\Desktop\pandas_import.xlsx",na_values=['nono','not applicable','na'])   # without 'r' it will give error
df

df.to_excel(r"C:\Users\Ajay\Desktop\new_pandas_import.xlsx",index=False)  # it will produce new excel to store new changes i have made till now
 # index is false so no indexing in my new file

In [43]:
# we  can restrict our column  in our new excel
df.to_excel(r"C:\Users\Ajay\Desktop\new_pandas_import.xlsx",columns=['amit','bca']) 
# it will show oly 2 column hence we provide it

In [44]:
df.columns

Index([1, 'amit', 'bca', 22, 'pass', 'sharedown'], dtype='object')

In [47]:
df.to_excel(r"C:\Users\Ajay\Desktop\new_pandas_import.xlsx",header=False,index=False,columns=['amit','bca']) 
# no index and header in excel file becasue of False keyword

In [53]:
df=pd.read_excel(r"C:\Users\Ajay\Desktop\new_pandas_import.xlsx","Sheet2")   # now this time i have provided sheet name 
df   # output will be emplty becasue no data in heet 2 file

Empty DataFrame
Columns: []
Index: []

In [54]:
# now we will use function 
def convert(cell):
    if cell=='n.a':
        return "SAM"
    else:
        return cell
df=pd.read_excel(r"C:\Users\Ajay\Desktop\new_pandas_import.xlsx","Sheet1",converters={
    "name":convert
})   # in this i have learnt that we ca change value with function as well
# degree would have been change if i used in dictionary

In [55]:
df

     name degree
0    ajay    mca
1  anurag    mca
2     SAM    n.a
3   ashok    mba

In [56]:
# converters are use to convert messy dat into usefull data 
# i wil study later about converter
df.to_excel(r"C:\Users\Ajay\Desktop\new_1pandas_import.xlsx",startrow=4,startcol=1)  # two new function in excel

In [57]:
# we can add two dataframes 
df_stocks=pd.DataFrame({
    'tickers':["google","apple","microsft"]
})
df_rocks=pd.DataFrame({
    'tickers':["google","apple","microsft"]
})  # i have created two dataframes

In [62]:
with pd.ExcelWriter("two_dataframes_in excel_file_with_different_sheet.xlsx") as writer:
    df_stocks.to_excel(writer,sheet_name="stocks")
    df_rocks.to_excel(writer,sheet_name="rocks")#its working

#  handling missin data in pandas